[
  {
    "_id": "1",
    "Weeks": "1 & 2",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "DEFINITION OF HISTORY Origin of History and Why we study History"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objectives": [
      {
        "id": "1",
        "value": "By the end of the lesson students should be able:   Explain the concept  H of History, origin i.e Greece, Herodotus the first objective History book, the authors and why was the first book in history –Histories written etc.Describe the reasons why we study History and the significance;Discuss the relevance of History to current issues in Nigeria"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "Student as a class brainstorm on the concept/origin of history. Students as a class are guided to give reasons for the study of history and its&nbsp; significance Students as a small groups discuss and relate relevance of history to current issues in Nigeria and present to the class"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "Critical and problem solvingLeadership and personal developmentCommunication and collaborationCreativity and imagination."
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "Critical and problem solvingLeadership and personal developmentCommunication and collaborationCreativity and imagination.  "
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "3",
    "Weeks": "3",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "SOURCES OF HISTORY Dating, Historical skills, and the prospects of ICT in Historical studies"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objectives": [
      {
        "id": "1",
        "value": "By the end of the lesson, student should be able to: 1. Mention the different types of sources and discuss the advantages and limitations of the different types of sources in History."
      },
      {
        "id": "2",
        "value": "2. Explain the meaning of Historical skills and appraise the relevance of ICT in Historical studies."
      },
      {
        "id": "3",
        "value": "3. Relate the importance of calendars in History i.e. B.C, A.D, A.H etc. give examples of other Calendars in History i.e. Igbo, Hindu, Chinese, etc. and know how to count Dates in History, i.e. the range of a century, etc."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "1.Students as a class discuss on the different types of sources in history/ types of historical skills  "
      },
      {
        "id": "2",
        "value": "2. Students in small groups debate on the importance of Dates and Chronology in History i.e. BC., AD/AH etc."
      },
      {
        "id": "3",
        "value": "3. Students as a class research on the relevance of ICT in Historical studies, for presentation in the next class.;"
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "1.Communication and Collaboration  "
      },
      {
        "id": "2",
        "value": " 2. Critical thinking and problem solving"
      },
      {
        "id": "3",
        "value": "3. Creativity and Imagination"
      },
      {
        "id": "4",
        "value": " 4. Student leadership and personal development"
      },
      {
        "id": "5",
        "value": " 5. Digital Literacy."
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "youtu.be/uZ73ZsBkcus"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "4",
    "Weeks": "4",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "LAND AND PEOPLE OF NIGERIA (Historical Geography of Nigeria)"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "By the end of the lesson, students should be able to: 1. describe the main geographical features in Nigeria i.e. people traditions of origins, precolonial occupations, transport, housing models, states etc. on the map of Nigeria "
      },
      {
        "id": "2",
        "value": "2. identify the impact of geography on the history of Nigerian people."
      },
      {
        "id": "3",
        "value": "3. explain the origin of Nigerian people and its tradition i.e. Yoruba, Kanuri Hausa, Igbo .etc."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "1. Students as a class are guided to mention the four major zones of Historical Significance in Nigeria. "
      },
      {
        "id": "2",
        "value": "2. Students in small groups discuss and analyze the impact of geography on history of Nigeria and its people today"
      },
      {
        "id": "3",
        "value": "3. Students as a class brainstorm on various origin of the tradition of Nigeria and its people."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "1. Critical thinking and problem solving 2. Communication and Collaboration 3. Creativity and imagination 4. Student leadership and personal development 5. Digital literacy"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": " i: a physical map of Nigeria showing location of various geographical zones "
      },
      {
        "id": "2",
        "value": "ii. a pictures chart showing different Nigeria culture and traditions . i.e. occupations, mode of transportation .etc."
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "5",
    "Weeks": "5",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "CENTRES OF ANCIENT CIVILIZATION IN NIGERIA .i.e. Nok etc. Importance of museums, Natural wild life parks, monuments, zoos .etc."
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "By the end of the lesson students should be able to: 1. locate Nok, Igbo-Ukwu, Ife and Benin .etc. on the map of Nigeria and identify the main discoveries of notable archaeologist .i.e. their discoveries, sites and importance.etc."
      },
      {
        "id": "2",
        "value": "2. Examine the relation between the various centers of ancient civilizations in Nigeria and its significance to historical development in Nigeria."
      },
      {
        "id": "3",
        "value": "3. Explain the importance of Museums, Natural wild life parks, Monuments, statutes, .etc. to the development of Historical tourism in Nigeria."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "1.Students in small group locate the ancient centers of civilization using the Nigerian map and analyze the significance of various ancient centers of civilization "
      },
      {
        "id": "2",
        "value": " 2. Students are guided on an organised excursion to historical places such as Museum in the locality to view some of the Artifacts discovered in each of the ancient sites and their importance"
      },
      {
        "id": "3",
        "value": "3. Students individually research and write short note on the importance of Museums, Natural wild life parks, Monuments, Statutes, .etc. to the development of Historical tourism in Nigeria for presentation in next class."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "1.Critical thinking and problem solving"
      },
      {
        "id": "2",
        "value": "2. Communication and Collaboration"
      },
      {
        "id": "3",
        "value": "3. Creativity and Imagination"
      },
      {
        "id": "4",
        "value": "4. Student leadership and personal development"
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": " i. map of Nigeria showing the centers of ancient civilization in Nigeria. "
      },
      {
        "id": "2",
        "value": "ii. a picture chart showing different cultural artifacts of ancient civilization"
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "6",
    "Weeks": "6",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "STATE FORMATION PROCESS IN PRE-COLONIAL NIGERIA Centralized states in Nigeria Hausa, Igbo, Yoruba, Ibibio, .etc."
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "By the end of the lesson students should be able to: 1.mention the factors that influenced the process of state formation in Nigeria  "
      },
      {
        "id": "2",
        "value": "2. Identify the Centralized and Non-centralized states in Pre-colonial Nigeria."
      },
      {
        "id": "3",
        "value": "3. Highlight the characteristics of centralized and Non-centralized states in Pre-colonial Nigeria and explain the differences and similarities of Centralized and Non-centralized states in Nigeria."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "1.Students as a class brainstorm on the factors that influenced the process of state formation in Nigeria "
      },
      {
        "id": "2",
        "value": "2. Students in pairs are guided to identify the Centralized and Non-centralized states in pre-colonial&nbsp; Nigeria "
      },
      {
        "id": "3",
        "value": "3. Students in small groups discuss the characteristics of Centralized and Non-Centralized states in Pre-colonial Nigeria."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": "1.Critical thinking and problem solving"
      },
      {
        "id": "2",
        "value": "2. Communication and Collaboration "
      },
      {
        "id": "3",
        "value": " 3. Creativity and Imagination"
      },
      {
        "id": "4",
        "value": " 4. Digital Literacy."
      }
    ]
  },
 
  {
    "_id": "8",
    "Weeks": "8 & 9",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "PEOPLE OF THE SUDAN AND SAHEL SAVANNAH ZONE IN NIGERIA .i.e. Kanuri, Hausa, .etc. in pre-colonial era"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "By the end of the lesson students should be able to: 1. Describe the origin and socio-political organization of Kanuris and the Hausas in Nigeria. ;"
      },
      {
        "id": "2",
        "value": "2. explain the reasons for the rise and collapse the kanem-Bornu Empire and Hausa land in the pre-colonial times. "
      },
      {
        "id": "3",
        "value": "3.identify important rulers of Kanem-Bornu Empire and Hausa land, their achievements .i.e Mai Idris Alooma, Sarkin Muhammed Rumfa .etc. and impact on Nigeria today."
      },
      {
        "id": "4",
        "value": " 4. Outline the significance of Royal women and Queen’s in Kanem Borno Empire i.e. Magira and Queen Amina in Zaria-Hausa land .etc."
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "1.Students as a class are guided to describe geographical zones and their origin"
      },
      {
        "id": "2",
        "value": " 2. Students in small groups discuss and relates the achievements of Great rulers and royal women in zone i.e. Mai Idris Alooma and Sarkin Muhammed Rumfa –Kano Queen Amina-Zaria .etc. "
      },
      {
        "id": "3",
        "value": "3. Students describe the socio-political organization in the sudan Sahel savanna zone in Nigeria .i.e. Kanuri Empire and Hausa Empire and Hausa land, .etc."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "1.Critical thinking and problem solving "
      },
      {
        "id": "2",
        "value": "2. Communication and Collaboration"
      },
      {
        "id": "3",
        "value": "3. Creativity and Innovation 4. Leadership and personal development."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": " I. Historical map Nigeria’s Sudan Sahel savannah zone   "
      },
      {
        "id": "2",
        "value": "ii picture chart showing important rulers"
      },
      {
        "id": "3",
        "value": "iii. Picture chart showing economy activities in the Sudan Sahel Savannah zone."
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
 
  {
    "_id": "10",
    "Weeks": "11",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": "PEOPLE OF THE FOREST REGION THE YORUBA’S THE BENIN’S [BINI,EDO THE IBO’S [IGBO]"
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": "By the end of the lesson students should be able to: 1.mention the people in the forest zone in Nigeria, i.e. Yoruba’s, Benin’s and the Igbos traditions of origins, pre-colonial transport models main occupation, housing designs, state in the forest zone .etc."
      },
      {
        "id": "2",
        "value": "2. describe the relations between lle ife and the rest of Yoruba land, reasons for&nbsp; the rise of old Oyo empire, socio-political and economic organization in the old Oyo empire in the pre-colonial times and impacts on Nigeria today"
      },
      {
        "id": "3",
        "value": " 3. discuss the stages of Benin developments reasons for the rise of benin kingdom achievements of great rulers i.e Oba Ewuare 1 the great, socio-political economic and place of traditional religion of Benin kingdom in the pre-colonial times "
      },
      {
        "id": "4",
        "value": "4. Explain the various traditions of Origins of non-centralized Igbos, the factors that Unites the Non-centralized Igbos in the precolonial times , Igbo pre-colonial social political systems, Importance of Age grades in Igboland, Reasons for Arochukwu Igbos dominance of Ig bo land in the Pre-colonial times."
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": "1. Students as a class mention the people of the forest zone, their traditions of Origins, Pre-colonial transport main occupations .etc. using the Nigeria map guide4. students in pairs highlight the various Origins/ Unifying factors/ land relevance of age grade in pre-colonial Igbo land"
      },
      {
        "id": "2",
        "value": " 2. Students as a class discuss&nbsp; the significance of lle ife to Yoruba’s and give reasons for the rise of old Oyo empire "
      },
      {
        "id": "3",
        "value": "3. Students in small groups identify the stages of Benin Emergence/ factors for the rise of Benin Kingdom, and the Achievements of great rulers, Socio-political Economic etc."
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": "By the end of the lesson students should be able to: 1.mention the people in the forest zone in Nigeria, i.e. Yoruba’s, Benin’s and the Igbos traditions of origins, pre-colonial transport models main occupation, housing designs, state in the forest zone .etc. 2. describe the relations between lle ife and the rest of Yoruba land, reasons for&nbsp; the rise of old Oyo empire, socio-political and economic organization in the old Oyo empire in the pre-colonial times and impacts on Nigeria today 3. discuss the stages of Benin developments reasons for the rise of benin kingdom achievements of great rulers i.e Oba Ewuare 1 the great, socio-political economic and place of traditional religion of Benin kingdom in the pre-colonial times 4. Explain the various traditions of Origins of non-centralized Igbos, the factors that Unites the Non-centralized Igbos in the precolonial times , Igbo pre-colonial social political systems, Importance of Age grades in Igboland, Reasons for Arochukwu Igbos dominance of Ig bo land in the Pre-colonial times."
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "11",
    "Weeks": "11",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Objects": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Activities": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Embedded Core Skills": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Learning Resources": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ]
  },
  {
    "_id": "12",
    "Weeks": "12",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "REVISION"
  },
  {
    "_id": "13",
    "Weeks": "13",
    "Subject": "History",
    "Class": "SS1",
    "Term": "First Term",
    "Topics": [
      {
        "id": "1",
        "value": ""
      },
      {
        "id": "2",
        "value": ""
      },
      {
        "id": "3",
        "value": ""
      },
      {
        "id": "4",
        "value": ""
      }
    ],
    "Status": "EXAMINATION"
  }
]
